_src/posts/version-2016-08-07.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       version
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2016-08-07 20:00>
#+filetags:        knowledge
#+DESCRIPTION: 一些可以用做中国特色的版本

#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil


周天。节气。星宿（加日月）。时辰。五行。八卦。二仪。


* 周天：
|------+------+------+------+------+------+------+------+------+------|
| 甲子 | 乙丑 | 丙寅 | 丁卯 | 戊辰 | 己巳 | 庚午 | 辛未 | 壬申 | 癸酉 |
|------+------+------+------+------+------+------+------+------+------|
| 甲申 | 乙酉 | 丙戌 | 丁亥 | 戊子 | 己丑 | 庚寅 | 辛卯 | 壬辰 | 癸巳 |
|------+------+------+------+------+------+------+------+------+------|
| 甲戌 | 乙亥 | 丙子 | 丁丑 | 戊寅 | 己卯 | 庚辰 | 辛巳 | 壬午 | 癸未 |
|------+------+------+------+------+------+------+------+------+------|
| 甲申 | 乙酉 | 丙戌 | 丁亥 | 戊子 | 己丑 | 庚寅 | 辛卯 | 壬辰 | 癸巳 |
|------+------+------+------+------+------+------+------+------+------|
| 甲午 | 乙未 | 丙申 | 丁酉 | 戊戌 | 己亥 | 庚子 | 辛丑 | 壬寅 | 癸卯 |
|------+------+------+------+------+------+------+------+------+------|
| 甲辰 | 乙巳 | 丙午 | 丁未 | 戊申 | 己酉 | 庚戌 | 辛亥 | 壬子 | 癸丑 |
|------+------+------+------+------+------+------+------+------+------|
| 甲寅 | 乙卯 | 丙辰 | 丁巳 | 戊午 | 己未 | 庚申 | 辛酉 | 壬戌 | 癸亥 |
|------+------+------+------+------+------+------+------+------+------|


* 节气:
|------+------+------+------+------+------+------+------+------+------+------+------|
| 立春 | 雨水 | 惊蛰 | 春分 | 清明 | 谷雨 | 立夏 | 小满 | 芒种 | 夏至 | 小暑 | 大暑 |
|------+------+------+------+------+------+------+------+------+------+------+------|
| 立秋 | 处暑 | 白露 | 秋分 | 寒露 | 霜降 | 立冬 | 小雪 | 大雪 | 冬至 | 小寒 | 大寒 |
|------+------+------+------+------+------+------+------+------+------+------+------|

|------+-------------------------------------------------------|
| 立春 | the Beginning of Spring (1st solar term)Feb.3,4, or 5 |
|------+-------------------------------------------------------|
|雨水| Rain Water (2nd solar term)Feb.18,19 or 20              |
|------+-------------------------------------------------------|
|惊蜇| the Waking of Insects (3rd solar term)Mar.5,6, or 7     |
|------+-------------------------------------------------------|
|春分| the Spring Equinox (4th solar term)Mar.20,21 or 22      |
|------+-------------------------------------------------------|
|清明| Pure Brightness (5th solar term)Apr.4,5 or 6            |
|------+-------------------------------------------------------|
|谷雨| Grain Rain (6th solar term)Apr.19,20 or 21              |
|------+-------------------------------------------------------|
|立夏| the Beginning of Summer (7th solar term)May 5,6 or 7    |
|------+-------------------------------------------------------|
|小满| Lesser Fullness of Grain (8th solar term)May 20,21, 22  |
|------+-------------------------------------------------------|
|芒种| Grain in Beard (9th solar term)Jun.5,6 or 7             |
|------+-------------------------------------------------------|
|夏至| the Summer Solstice (10th solar term)Jun.21 or 22       |
|------+-------------------------------------------------------|
|小暑| Lesser Heat (11th solar term)Jul.6,7 or 8               |
|------+-------------------------------------------------------|
|大暑| Greater Heat (12th solar term)Jul.22,23 or 24           |
|------+-------------------------------------------------------|
|立秋| the Beginning of Autumn (13th solar term)Aug.7,8 or 9   |
|------+-------------------------------------------------------|
|处暑| the End of Heat (14th solar term)Aug.22,23 or 24        |
|------+-------------------------------------------------------|
|白露| White Dew (15th solar term)Sep.7,8 or 9                 |
|------+-------------------------------------------------------|
|秋分| the Autumn Equinox (16th solar term)Sep.22,23 or 24     |
|------+-------------------------------------------------------|
|寒露| Cold Dew (17th solar term)Oct.8 or 9                    |
|------+-------------------------------------------------------|
|霜降| Frost's Descent (18th solar term)Oct.23 or 24           |
|------+-------------------------------------------------------|
|立冬| the Beginning of Winter (19th solar term)Nov.7 or 8     |
|------+-------------------------------------------------------|
|小雪| Lesser Snow (20th solar term)Nov.22 or 23               |
|------+-------------------------------------------------------|
|大雪| Greater Snow (21th solar term)Dec.6,7 or 8              |
|------+-------------------------------------------------------|
|冬至| the Winter Solstice (22th solar term)Dec.21,22 or 23    |
|------+-------------------------------------------------------|
|小寒| Lesser Cold (23th solar term)Jan.5,6 or 7               |
|------+-------------------------------------------------------|
|大寒| Greater Cold (24th solar term)Jan.20 or 2               |
|------+-------------------------------------------------------|

* 星宿
|----------+--------+--------+--------+--------+--------+--------+--------|
| 东宫青龙 | 角木蛟 | 亢金龙 | 氐土貉 | 房日兔 | 心月狐 | 尾火虎 | 箕水豹 |
|----------+--------+--------+--------+--------+--------+--------+--------|
| 南宫朱雀 | 井木犴 | 鬼金羊 | 柳土獐 | 星日马 | 张月鹿 | 翼火蛇 | 轸水蚓 |
|----------+--------+--------+--------+--------+--------+--------+--------|
| 西宫白虎 | 奎木狼 | 娄金狗 | 胃土雉 | 昂日鸡 | 毕月乌 | 觜火猴 | 参水猿 |
|----------+--------+--------+--------+--------+--------+--------+--------|
| 北宫玄武 | 斗木獬 | 牛金牛 | 女土蝠 | 虚日鼠 | 危月燕 | 室火猪 | 壁水獐 |
|----------+--------+--------+--------+--------+--------+--------+--------|

* 时辰:
|----+----+----+----+----+----+----+----+----+----+----+----|
| 子 | 丑 | 寅 | 卯 | 辰 | 巳 | 午 | 未 | 申 | 酉 | 戌 | 亥 |
|----+----+----+----+----+----+----+----+----+----+----+----|

* 五行：
|------+----+----+----+----+----|
| 相生 | 金 | 水 | 木 | 火 | 土 |
|------+----+----+----+----+----|
| 相克 | 金 | 木 | 土 | 水 | 火 |
|------+----+----+----+----+----|

* 八卦：
|----+----+----+----+----+----+----+----|
| 乾 | 兑 | 离 | 震 | 巽 | 坎 | 艮 | 坤 |
|----+----+----+----+----+----+----+----|

* 代号：节气（24） 八卦（8） 32
** 主次版本号组合=周天（60）
** RC号：四象。东风，南风，西风，北风
** 测试号：二仪。日=beta 月=alpha

** 主版本号：五行（5）
** 次版本号：时辰（12）
** 小版本号：星宿（4）
** 末版本号：星宿（7）

5 X 12 X 4 X 7= 1680 个版本
