posts/version-2016-08-07.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>version</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">version</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#knowledge"><div class="category">knowledge</div></a> </div>
<div class="char-counter">2016-08-07</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org85485d6">周天：</a></li>
<li><a href="#org67c84b2">节气:</a></li>
<li><a href="#orgbc84884">星宿</a></li>
<li><a href="#org3522b7a">时辰:</a></li>
<li><a href="#orge16db2b">五行：</a></li>
<li><a href="#org90db36c">八卦：</a></li>
<li><a href="#orgfd4d189">代号：节气（24） 八卦（8） 32</a>
<ul>
<li><a href="#org36dd8f8">主次版本号组合=周天（60）</a></li>
<li><a href="#orga75a402">RC号：四象。东风，南风，西风，北风</a></li>
<li><a href="#orgd8a4d8c">测试号：二仪。日=beta 月=alpha</a></li>
<li><a href="#orgcf73d14">主版本号：五行（5）</a></li>
<li><a href="#org9e2151e">次版本号：时辰（12）</a></li>
<li><a href="#org628276d">小版本号：星宿（4）</a></li>
<li><a href="#orgdccd473">末版本号：星宿（7）</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
周天。节气。星宿（加日月）。时辰。五行。八卦。二仪。
</p>


<div id="outline-container-org85485d6" class="outline-2">
<h2 id="org85485d6">周天：</h2>
<div class="outline-text-2" id="text-org85485d6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">甲子</th>
<th scope="col" class="org-left">乙丑</th>
<th scope="col" class="org-left">丙寅</th>
<th scope="col" class="org-left">丁卯</th>
<th scope="col" class="org-left">戊辰</th>
<th scope="col" class="org-left">己巳</th>
<th scope="col" class="org-left">庚午</th>
<th scope="col" class="org-left">辛未</th>
<th scope="col" class="org-left">壬申</th>
<th scope="col" class="org-left">癸酉</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">甲申</td>
<td class="org-left">乙酉</td>
<td class="org-left">丙戌</td>
<td class="org-left">丁亥</td>
<td class="org-left">戊子</td>
<td class="org-left">己丑</td>
<td class="org-left">庚寅</td>
<td class="org-left">辛卯</td>
<td class="org-left">壬辰</td>
<td class="org-left">癸巳</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">甲戌</td>
<td class="org-left">乙亥</td>
<td class="org-left">丙子</td>
<td class="org-left">丁丑</td>
<td class="org-left">戊寅</td>
<td class="org-left">己卯</td>
<td class="org-left">庚辰</td>
<td class="org-left">辛巳</td>
<td class="org-left">壬午</td>
<td class="org-left">癸未</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">甲申</td>
<td class="org-left">乙酉</td>
<td class="org-left">丙戌</td>
<td class="org-left">丁亥</td>
<td class="org-left">戊子</td>
<td class="org-left">己丑</td>
<td class="org-left">庚寅</td>
<td class="org-left">辛卯</td>
<td class="org-left">壬辰</td>
<td class="org-left">癸巳</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">甲午</td>
<td class="org-left">乙未</td>
<td class="org-left">丙申</td>
<td class="org-left">丁酉</td>
<td class="org-left">戊戌</td>
<td class="org-left">己亥</td>
<td class="org-left">庚子</td>
<td class="org-left">辛丑</td>
<td class="org-left">壬寅</td>
<td class="org-left">癸卯</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">甲辰</td>
<td class="org-left">乙巳</td>
<td class="org-left">丙午</td>
<td class="org-left">丁未</td>
<td class="org-left">戊申</td>
<td class="org-left">己酉</td>
<td class="org-left">庚戌</td>
<td class="org-left">辛亥</td>
<td class="org-left">壬子</td>
<td class="org-left">癸丑</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">甲寅</td>
<td class="org-left">乙卯</td>
<td class="org-left">丙辰</td>
<td class="org-left">丁巳</td>
<td class="org-left">戊午</td>
<td class="org-left">己未</td>
<td class="org-left">庚申</td>
<td class="org-left">辛酉</td>
<td class="org-left">壬戌</td>
<td class="org-left">癸亥</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org67c84b2" class="outline-2">
<h2 id="org67c84b2">节气:</h2>
<div class="outline-text-2" id="text-org67c84b2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">立春</th>
<th scope="col" class="org-left">雨水</th>
<th scope="col" class="org-left">惊蛰</th>
<th scope="col" class="org-left">春分</th>
<th scope="col" class="org-left">清明</th>
<th scope="col" class="org-left">谷雨</th>
<th scope="col" class="org-left">立夏</th>
<th scope="col" class="org-left">小满</th>
<th scope="col" class="org-left">芒种</th>
<th scope="col" class="org-left">夏至</th>
<th scope="col" class="org-left">小暑</th>
<th scope="col" class="org-left">大暑</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">立秋</td>
<td class="org-left">处暑</td>
<td class="org-left">白露</td>
<td class="org-left">秋分</td>
<td class="org-left">寒露</td>
<td class="org-left">霜降</td>
<td class="org-left">立冬</td>
<td class="org-left">小雪</td>
<td class="org-left">大雪</td>
<td class="org-left">冬至</td>
<td class="org-left">小寒</td>
<td class="org-left">大寒</td>
</tr>
</tbody>
</table>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">立春</th>
<th scope="col" class="org-left">the Beginning of Spring (1st solar term)Feb.3,4, or 5</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">雨水</td>
<td class="org-left">Rain Water (2nd solar term)Feb.18,19 or 20</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">惊蜇</td>
<td class="org-left">the Waking of Insects (3rd solar term)Mar.5,6, or 7</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">春分</td>
<td class="org-left">the Spring Equinox (4th solar term)Mar.20,21 or 22</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">清明</td>
<td class="org-left">Pure Brightness (5th solar term)Apr.4,5 or 6</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">谷雨</td>
<td class="org-left">Grain Rain (6th solar term)Apr.19,20 or 21</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">立夏</td>
<td class="org-left">the Beginning of Summer (7th solar term)May 5,6 or 7</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">小满</td>
<td class="org-left">Lesser Fullness of Grain (8th solar term)May 20,21, 22</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">芒种</td>
<td class="org-left">Grain in Beard (9th solar term)Jun.5,6 or 7</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">夏至</td>
<td class="org-left">the Summer Solstice (10th solar term)Jun.21 or 22</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">小暑</td>
<td class="org-left">Lesser Heat (11th solar term)Jul.6,7 or 8</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">大暑</td>
<td class="org-left">Greater Heat (12th solar term)Jul.22,23 or 24</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">立秋</td>
<td class="org-left">the Beginning of Autumn (13th solar term)Aug.7,8 or 9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">处暑</td>
<td class="org-left">the End of Heat (14th solar term)Aug.22,23 or 24</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">白露</td>
<td class="org-left">White Dew (15th solar term)Sep.7,8 or 9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">秋分</td>
<td class="org-left">the Autumn Equinox (16th solar term)Sep.22,23 or 24</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">寒露</td>
<td class="org-left">Cold Dew (17th solar term)Oct.8 or 9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">霜降</td>
<td class="org-left">Frost's Descent (18th solar term)Oct.23 or 24</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">立冬</td>
<td class="org-left">the Beginning of Winter (19th solar term)Nov.7 or 8</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">小雪</td>
<td class="org-left">Lesser Snow (20th solar term)Nov.22 or 23</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">大雪</td>
<td class="org-left">Greater Snow (21th solar term)Dec.6,7 or 8</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">冬至</td>
<td class="org-left">the Winter Solstice (22th solar term)Dec.21,22 or 23</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">小寒</td>
<td class="org-left">Lesser Cold (23th solar term)Jan.5,6 or 7</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">大寒</td>
<td class="org-left">Greater Cold (24th solar term)Jan.20 or 2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbc84884" class="outline-2">
<h2 id="orgbc84884">星宿</h2>
<div class="outline-text-2" id="text-orgbc84884">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">东宫青龙</th>
<th scope="col" class="org-left">角木蛟</th>
<th scope="col" class="org-left">亢金龙</th>
<th scope="col" class="org-left">氐土貉</th>
<th scope="col" class="org-left">房日兔</th>
<th scope="col" class="org-left">心月狐</th>
<th scope="col" class="org-left">尾火虎</th>
<th scope="col" class="org-left">箕水豹</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">南宫朱雀</td>
<td class="org-left">井木犴</td>
<td class="org-left">鬼金羊</td>
<td class="org-left">柳土獐</td>
<td class="org-left">星日马</td>
<td class="org-left">张月鹿</td>
<td class="org-left">翼火蛇</td>
<td class="org-left">轸水蚓</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">西宫白虎</td>
<td class="org-left">奎木狼</td>
<td class="org-left">娄金狗</td>
<td class="org-left">胃土雉</td>
<td class="org-left">昂日鸡</td>
<td class="org-left">毕月乌</td>
<td class="org-left">觜火猴</td>
<td class="org-left">参水猿</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">北宫玄武</td>
<td class="org-left">斗木獬</td>
<td class="org-left">牛金牛</td>
<td class="org-left">女土蝠</td>
<td class="org-left">虚日鼠</td>
<td class="org-left">危月燕</td>
<td class="org-left">室火猪</td>
<td class="org-left">壁水獐</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3522b7a" class="outline-2">
<h2 id="org3522b7a">时辰:</h2>
<div class="outline-text-2" id="text-org3522b7a">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">子</td>
<td class="org-left">丑</td>
<td class="org-left">寅</td>
<td class="org-left">卯</td>
<td class="org-left">辰</td>
<td class="org-left">巳</td>
<td class="org-left">午</td>
<td class="org-left">未</td>
<td class="org-left">申</td>
<td class="org-left">酉</td>
<td class="org-left">戌</td>
<td class="org-left">亥</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge16db2b" class="outline-2">
<h2 id="orge16db2b">五行：</h2>
<div class="outline-text-2" id="text-orge16db2b">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">相生</th>
<th scope="col" class="org-left">金</th>
<th scope="col" class="org-left">水</th>
<th scope="col" class="org-left">木</th>
<th scope="col" class="org-left">火</th>
<th scope="col" class="org-left">土</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">相克</td>
<td class="org-left">金</td>
<td class="org-left">木</td>
<td class="org-left">土</td>
<td class="org-left">水</td>
<td class="org-left">火</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org90db36c" class="outline-2">
<h2 id="org90db36c">八卦：</h2>
<div class="outline-text-2" id="text-org90db36c">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">乾</td>
<td class="org-left">兑</td>
<td class="org-left">离</td>
<td class="org-left">震</td>
<td class="org-left">巽</td>
<td class="org-left">坎</td>
<td class="org-left">艮</td>
<td class="org-left">坤</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfd4d189" class="outline-2">
<h2 id="orgfd4d189">代号：节气（24） 八卦（8） 32</h2>
<div class="outline-text-2" id="text-orgfd4d189">
</div>
<div id="outline-container-org36dd8f8" class="outline-3">
<h3 id="org36dd8f8">主次版本号组合=周天（60）</h3>
</div>
<div id="outline-container-orga75a402" class="outline-3">
<h3 id="orga75a402">RC号：四象。东风，南风，西风，北风</h3>
</div>
<div id="outline-container-orgd8a4d8c" class="outline-3">
<h3 id="orgd8a4d8c">测试号：二仪。日=beta 月=alpha</h3>
</div>

<div id="outline-container-orgcf73d14" class="outline-3">
<h3 id="orgcf73d14">主版本号：五行（5）</h3>
</div>
<div id="outline-container-org9e2151e" class="outline-3">
<h3 id="org9e2151e">次版本号：时辰（12）</h3>
</div>
<div id="outline-container-org628276d" class="outline-3">
<h3 id="org628276d">小版本号：星宿（4）</h3>
</div>
<div id="outline-container-orgdccd473" class="outline-3">
<h3 id="orgdccd473">末版本号：星宿（7）</h3>
<div class="outline-text-3" id="text-orgdccd473">
<p>
5 X 12 X 4 X 7= 1680 个版本
</p>
</div>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
